#include "includes.h"

//==================================================================================================
//| 函数名称 | KeyDoublePro 
//|----------|--------------------------------------------------------------------------------------
//| 函数功能 | 起爆双键(1+3键)键消息响应函数
//|----------|--------------------------------------------------------------------------------------
//| 输入参数 | msg 待处理消息
//|----------|--------------------------------------------------------------------------------------       
//| 返回参数 | 无
//|----------|--------------------------------------------------------------------------------------       
//| 函数设计 | 编写人：李亚东    时间：2016-08-25 
//|----------|-------------------------------------------------------------------------------------- 
//|   备注   | 
//|----------|-------------------------------------------------------------------------------------- 
//| 修改记录 | 修改人：          时间：         修改内容： 
//==================================================================================================
void KeyInPro(MSG msg)
{
	u8 HAVE_BOX = 1 ;
	u8 random ;
	
	//按键消息的时效性判断
	if((SYS_STATE)msg.param1 != GetCurrentState())
	{
		return ;
	}
	switch((SYS_STATE)msg.param1)
	{
		case WAIT_CARD_KEY://在主菜单下按‘存’键
			ShowSys_Message(0);
			while(HAVE_BOX)
			{
				random = GET_Random(); //刷卡后立即产生一个随机数
				HAVE_BOX = BOX_EMPTY(random);//等于0 的时候退出循环
				if(HAVE_BOX == 0)
				{
					USER_BOX_NUM = random;//随机数赋值给箱号
				}
			}
			ShowSys_Message(7);
			INPUT_PASS_STATE = 4;//密码存包第一次输入密码  4
			CARD_ID_INF[0] = random;  //密码存包的数据保存在索引区
			INPUT_DATA_AMOUNT = 0;	//已经输入的字符数置零				
			memset( INPUT_DATA_NUM, '\0', sizeof(INPUT_DATA_NUM) );
			SetCurrentState(PASSW_INPUT_KEY);//密码存包第一次输入密码
			break;
		default:
			break;
	}
}
